views/dashboard/index.php

SELECT * FROM `ticket_values` WHERE (date(date)='2018-12-17') AND (time(time)='09:00:00') AND (`location_id`=1)
---
                                                    >
                                                </td><td> <input type="checkbox" name="' . $location['location_id'] . '"> </td>';

                                            $isRecordAvailable = \app\models\TicketValues::find()
                                                ->where(['date(date)' => date('Y-m-d')])
                                                ->andWhere(['time(time)' => date('H:i:s', strtotime($newTime))])
                                                ->andWhere(['location_id' => $location['location_id']])
                                                ->one();

SELECT * FROM `location` GROUP BY `location_id`
SELECT * FROM `ticket_values` WHERE `location_id`=1 ORDER BY `ticket_value_id` DESC LIMIT 20
---
</div>
<div class="row">
<?php
    $locations = Location::find()->groupBy(['location_id'])->all();
    if($locations):
    foreach ($locations as $key => $location):
        $ticketdata = TicketValues::find()->where(['location_id' => $location->location_id])->orderBy(['ticket_value_id' => SORT_DESC])->limit(20)->all();