controllers/DashboardController.php

    public function actionIndex()
    {
        //return $this->render('index');
        //$tickets = TicketValues::find()->where(['=', 'date(date)', date('Y-m-d')])->groupBy(['location_id'])->orderBy(['time' => SORT_ASC])->all();
        //$tickets = Location::find()->groupBy(['location_id'])->orderBy(['time' => SORT_ASC])->all();
        $tickets = Location::find()->groupBy(['location_id'])->all();
---
SELECT * FROM `location` GROUP BY `location_id`