controllers/DashboardController.php

    public function actionSingleData($location_id,$time,$value)
    {
        $model = new TicketValues();

        if (!empty($location_id)&& !empty($time) && !empty($value))
        {
            $isRecordAvailable = \app\models\TicketValues::find()
                ->where(['date(date)' => date('Y-m-d')])
                ->andWhere(['time' => $time])
                ->andWhere(['location_id' => $location_id])
                ->one();
---
SELECT * FROM `ticket_values` WHERE (`location_id`=1) AND (date(date) = '2018-12-17') AND (time(time) <= '14:52:17') ORDER BY `ticket_value_id` DESC