controllers/WsController.php

    public function actionSaveTimeSlots()
    {
        $request = Yii::$app->request->post();
        $values = !empty($request['values']) ? $request['values'] : '';
        $locations = !empty($request['locations']) ? $request['locations'] : '';
        $times = !empty($request['times']) ? $request['times'] : '';
        foreach ($values as $key => $value) {
            $isRecordAvailable = \app\models\TicketValues::find()
                ->where(['date(date)' => date('Y-m-d')])
                ->andWhere(['time(time)' => date('H:i:s', strtotime($times[$key]))])
                ->andWhere(['location_id' => $locations[$key]])
                ->one();
            if (empty($isRecordAvailable)) {
                $newTicket = new TicketValues();
                $newTicket->location_id = $locations[$key];
                $newTicket->ticket_value = $value;
                $newTicket->time = date('H:i:s', strtotime($times[$key]));
                $newTicket->date = date('Y-m-d');
                $newTicket->created_at = date('Y-m-d H:i:s');
                $newTicket->save(false);
---
SELECT * FROM `ticket_values` WHERE (date(date)='2018-12-04') AND (time(time)='09:00:00') AND (`location_id`='1')
INSERT INTO `ticket_values` (`location_id`, `ticket_value`, `time`, `date`, `created_at`) VALUES (1, 150, '09:00:00', '2018-12-04', '2018-12-04 10:20:16')