models/Users.php

SELECT * FROM `users` WHERE `user_id`=4
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `users` WHERE `username`='himanshutank1111@gmail.com'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `users` WHERE `email`='himanshutank1111@gmail.com'
---
    public static function findByEmail($username)
    {
        return static::findOne(['email' => $username]);